tests/results/results_high_load.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: tests/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 043/500 VUs, 13 complete and 0 interrupted iterations
default   [   2% ] 043/500 VUs  00.9s/50.0s

running (0m01.9s), 093/500 VUs, 97 complete and 0 interrupted iterations
default   [   4% ] 093/500 VUs  01.8s/50.0s

running (0m02.9s), 143/500 VUs, 268 complete and 0 interrupted iterations
default   [   6% ] 143/500 VUs  02.8s/50.0s

running (0m03.9s), 193/500 VUs, 517 complete and 0 interrupted iterations
default   [   8% ] 193/500 VUs  03.8s/50.0s

running (0m04.9s), 242/500 VUs, 851 complete and 0 interrupted iterations
default   [  10% ] 242/500 VUs  04.8s/50.0s

running (0m06.0s), 297/500 VUs, 1221 complete and 0 interrupted iterations
default   [  12% ] 297/500 VUs  06.0s/50.0s

running (0m06.9s), 342/500 VUs, 1676 complete and 0 interrupted iterations
default   [  14% ] 342/500 VUs  06.9s/50.0s

running (0m07.9s), 392/500 VUs, 1993 complete and 0 interrupted iterations
default   [  16% ] 392/500 VUs  07.8s/50.0s

running (0m08.9s), 443/500 VUs, 2452 complete and 0 interrupted iterations
default   [  18% ] 443/500 VUs  08.9s/50.0s

running (0m09.9s), 492/500 VUs, 2975 complete and 0 interrupted iterations
default   [  20% ] 492/500 VUs  09.8s/50.0s

running (0m10.9s), 500/500 VUs, 3492 complete and 0 interrupted iterations
default   [  22% ] 500/500 VUs  10.8s/50.0s

running (0m11.9s), 500/500 VUs, 4013 complete and 0 interrupted iterations
default   [  24% ] 500/500 VUs  11.8s/50.0s

running (0m12.9s), 500/500 VUs, 4505 complete and 0 interrupted iterations
default   [  26% ] 500/500 VUs  12.8s/50.0s

running (0m13.9s), 500/500 VUs, 4872 complete and 0 interrupted iterations
default   [  28% ] 500/500 VUs  13.8s/50.0s

running (0m14.9s), 500/500 VUs, 5425 complete and 0 interrupted iterations
default   [  30% ] 500/500 VUs  14.8s/50.0s

running (0m15.9s), 500/500 VUs, 5786 complete and 0 interrupted iterations
default   [  32% ] 500/500 VUs  15.8s/50.0s

running (0m17.0s), 500/500 VUs, 6450 complete and 0 interrupted iterations
default   [  34% ] 500/500 VUs  16.9s/50.0s

running (0m17.9s), 500/500 VUs, 6861 complete and 0 interrupted iterations
default   [  36% ] 500/500 VUs  17.8s/50.0s

running (0m18.9s), 500/500 VUs, 7426 complete and 0 interrupted iterations
default   [  38% ] 500/500 VUs  18.8s/50.0s

running (0m19.9s), 500/500 VUs, 7886 complete and 0 interrupted iterations
default   [  40% ] 500/500 VUs  19.8s/50.0s

running (0m20.9s), 500/500 VUs, 8366 complete and 0 interrupted iterations
default   [  42% ] 500/500 VUs  20.8s/50.0s

running (0m21.9s), 500/500 VUs, 8826 complete and 0 interrupted iterations
default   [  44% ] 500/500 VUs  21.8s/50.0s

running (0m22.9s), 500/500 VUs, 9281 complete and 0 interrupted iterations
default   [  46% ] 500/500 VUs  22.8s/50.0s

running (0m23.9s), 500/500 VUs, 9701 complete and 0 interrupted iterations
default   [  48% ] 500/500 VUs  23.9s/50.0s

running (0m24.9s), 500/500 VUs, 10190 complete and 0 interrupted iterations
default   [  50% ] 500/500 VUs  24.9s/50.0s

running (0m25.9s), 500/500 VUs, 10670 complete and 0 interrupted iterations
default   [  52% ] 500/500 VUs  25.8s/50.0s

running (0m26.9s), 500/500 VUs, 11194 complete and 0 interrupted iterations
default   [  54% ] 500/500 VUs  26.8s/50.0s

running (0m27.9s), 500/500 VUs, 11662 complete and 0 interrupted iterations
default   [  56% ] 500/500 VUs  27.8s/50.0s

running (0m28.9s), 500/500 VUs, 12042 complete and 0 interrupted iterations
default   [  58% ] 500/500 VUs  28.8s/50.0s

running (0m29.9s), 500/500 VUs, 12510 complete and 0 interrupted iterations
default   [  60% ] 500/500 VUs  29.8s/50.0s

running (0m30.9s), 500/500 VUs, 12905 complete and 0 interrupted iterations
default   [  62% ] 500/500 VUs  30.8s/50.0s

running (0m31.9s), 500/500 VUs, 13347 complete and 0 interrupted iterations
default   [  64% ] 500/500 VUs  31.9s/50.0s

running (0m32.9s), 500/500 VUs, 13809 complete and 0 interrupted iterations
default   [  66% ] 500/500 VUs  32.8s/50.0s

running (0m33.9s), 500/500 VUs, 14244 complete and 0 interrupted iterations
default   [  68% ] 500/500 VUs  33.8s/50.0s

running (0m34.9s), 500/500 VUs, 14780 complete and 0 interrupted iterations
default   [  70% ] 500/500 VUs  34.9s/50.0s

running (0m35.9s), 500/500 VUs, 15273 complete and 0 interrupted iterations
default   [  72% ] 500/500 VUs  35.8s/50.0s

running (0m36.9s), 500/500 VUs, 15765 complete and 0 interrupted iterations
default   [  74% ] 500/500 VUs  36.8s/50.0s

running (0m37.9s), 500/500 VUs, 16276 complete and 0 interrupted iterations
default   [  76% ] 500/500 VUs  37.8s/50.0s

running (0m38.9s), 500/500 VUs, 16664 complete and 0 interrupted iterations
default   [  78% ] 500/500 VUs  38.8s/50.0s

running (0m39.9s), 500/500 VUs, 17330 complete and 0 interrupted iterations
default   [  80% ] 500/500 VUs  39.9s/50.0s

running (0m40.9s), 488/500 VUs, 17765 complete and 0 interrupted iterations
default   [  82% ] 488/500 VUs  40.9s/50.0s

running (0m41.9s), 436/500 VUs, 18205 complete and 0 interrupted iterations
default   [  84% ] 436/500 VUs  41.8s/50.0s

running (0m42.9s), 380/500 VUs, 18738 complete and 0 interrupted iterations
default   [  86% ] 380/500 VUs  42.8s/50.0s

running (0m43.9s), 319/500 VUs, 19268 complete and 0 interrupted iterations
default   [  88% ] 319/500 VUs  43.8s/50.0s

running (0m44.9s), 275/500 VUs, 19700 complete and 0 interrupted iterations
default   [  90% ] 275/500 VUs  44.8s/50.0s

running (0m45.9s), 224/500 VUs, 20084 complete and 0 interrupted iterations
default   [  92% ] 224/500 VUs  45.8s/50.0s

running (0m46.9s), 172/500 VUs, 20429 complete and 0 interrupted iterations
default   [  94% ] 172/500 VUs  46.8s/50.0s

running (0m47.9s), 123/500 VUs, 20690 complete and 0 interrupted iterations
default   [  96% ] 123/500 VUs  47.8s/50.0s

running (0m48.9s), 074/500 VUs, 20873 complete and 0 interrupted iterations
default   [  98% ] 074/500 VUs  48.8s/50.0s

running (0m49.9s), 019/500 VUs, 20988 complete and 0 interrupted iterations
default   [ 100% ] 019/500 VUs  49.8s/50.0s

     ✓ status is 200

     █ setup

     checks.........................: 100.00% ✓ 21007       ✗ 0    
     data_received..................: 1.9 GB  39 MB/s
     data_sent......................: 15 MB   300 kB/s
     http_req_blocked...............: avg=66.77µs  min=1.04µs   med=5.62µs   max=141.99ms p(90)=16.5µs   p(95)=27.77µs 
     http_req_connecting............: avg=39.1µs   min=0s       med=0s       max=141.66ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=39.25ms  min=395.83µs med=28.1ms   max=418.74ms p(90)=83.92ms  p(95)=110.87ms
       { expected_response:true }...: avg=39.25ms  min=395.83µs med=28.1ms   max=418.74ms p(90)=83.92ms  p(95)=110.87ms
     http_req_failed................: 0.00%   ✓ 0           ✗ 21009
     http_req_receiving.............: avg=1.56ms   min=18.87µs  med=165.12µs max=220.93ms p(90)=1.64ms   p(95)=4.62ms  
     http_req_sending...............: avg=972.16µs min=3.83µs   med=21.7µs   max=211.26ms p(90)=186.74µs p(95)=915.48µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=36.71ms  min=277.16µs med=26.77ms  max=418.66ms p(90)=78.65ms  p(95)=99.98ms 
     http_reqs......................: 21009   416.285662/s
     iteration_duration.............: avg=958.38ms min=54.24ms  med=990.87ms max=1.49s    p(90)=1.19s    p(95)=1.24s   
     iterations.....................: 21007   416.246033/s
     vus............................: 19      min=19        max=500
     vus_max........................: 500     min=500       max=500
     ws_connecting..................: avg=292.97ms min=311.04µs med=306.33ms max=794.27ms p(90)=542.9ms  p(95)=598.77ms
     ws_msgs_received...............: 4814600 95399.54054/s
     ws_msgs_sent...................: 21003   416.166774/s
     ws_session_duration............: avg=808.74ms min=122.1ms  med=825.73ms max=1.3s     p(90)=1.05s    p(95)=1.1s    
     ws_sessions....................: 21007   416.246033/s


running (0m50.5s), 000/500 VUs, 21007 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/500 VUs  50s